export const productMain = {
  FD: "식품",
  TO: "장난감",
  SP: "용품",
  FS: "의류",
};

export const proteinCode = {
  P01: "소고기",
  P02: "양고기",
  P03: "돼지고기",
  P04: "닭고기",
  P05: "오리고기",
  P06: "연어",
  P07: "생선",
  P08: "베지/곤충",
  P09: "혼합",
  P10: "캥거루",
  P11: "칠면조",
  P12: "토끼고기",
  P13: "기타",
};

export const animalCode = {
  DOG: "강아지",
  CAT: "고양이",
  ETC: "기타",
};

export const productSub = {
  FD: {
    41: "퍼피",
    42: "시니어",
    43: "전연령 (어덜트)",
  },
  TO: {
    21: "일반",
    22: "공/원반",
  },
  SP: {
    31: "위생",
    32: "산책",
    33: "펫가전",
  },
  FS: {
    11: "대형견",
    12: "중/소형견",
  },
};

export const branchCode = {
  101: "더현대 서울",
  102: "더현대 대구",
  201: "가산점",
  202: "가든파이브점",
  203: "SPACE 1",
  204: "송도점",
  205: "김포점",
};

export const breedCode = {
  D01: "포메라니안",
  D02: "저먼 셰퍼드",
  D03: "불독",
  D04: "푸들",
  D05: "치와와",
  D06: "말티즈",
  D07: "시바견",
  D08: "골든 리트리버",
  D09: "시베리안 허스키",
  D10: "닥스훈트",
  D11: "시츄",
  D12: "도베르만",
  D13: "그레이트 데인",
  D14: "웰시코기",
  D15: "요크셔 테리어",
  D16: "차우차우",
  D17: "달마시안",
  D18: "비숑",
  D19: "이탈리안 그레이하운드",
  D20: "샤페이",
  D21: "아프간 하운드",
  D22: "페키니즈",
  D23: "세인트버나드",
  D24: "잭 러셀 테리어",
  D25: "사모예드견",
  D26: "보더 콜리",
  D27: "비글",
  D28: "진돗개",
  D29: "불 테리어",
  D30: "퍼그",
  D99: "믹스",
};

export const sizeCode = {
  "D-BG": "대형견",
  "D-MD": "중형견",
  "D-SM": "소형견",
};

export const shopCategory = {
  FD: {
    name: "식품",
    subCategory: {
      41: "퍼피",
      42: "시니어",
      43: "전연령(어덜트)",
    },
  },
  TO: {
    name: "장난감",
    subCategory: {
      21: "일반",
      22: "공/원반",
    },
  },
  SP: {
    name: "용품",
    subCategory: {
      31: "위생",
      32: "산책",
      33: "펫가전",
    },
  },
  FS: {
    name: "의류",
    subCategory: {
      11: "대형견",
      12: "중/소형견",
    },
  },
};
